import 'package:flutter/material.dart';
import 'package:miswag/core/Widget/app_bar_widget.dart';

class AboutUsPage extends StatelessWidget {
  const AboutUsPage({super.key});

  @override
  Widget build(BuildContext context) {
    return const Scaffold(
      backgroundColor: Colors.white,
      appBar: AppBarWidget(pageNum: 0),
      body: SingleChildScrollView(
        padding: EdgeInsets.all(16.0),
        child: Text(
          textAlign: TextAlign.right,
          '''عن الشركة
مسواگ هو أول موقع للتسوق الألكتروني في العراق و أكبر موقع للتجارة بالتجزئة من حيث القيمة في السوق العراقي. تأسس موقع مسواگ سنة ٢٠١٤ و تم تصميمه و إنجازه من قبل مهارات عراقية على أيدي متخصصين في برمجة المواقع الألكترونية و خبراء تجاريين.

شركة مسواگ هي شركة عراقية مسجلة في العراق بصورة رسمية منذ تأسيسها، حيث حرص القائمين عليها بإنجاز جميع التعاملات و المهام بصور رسمية و قانونية حرصاً على الزبائن و التجار أولاً و لضمان حقوق جميع الأطراف ثانياً. حيث أن جميع التعاملات بين الشركة و التجار أو الزبائن تتم ضمن إطار القانون التجاري العراقي.

تأسست خدمة مسواگ كشركة ناشئة في بغداد لخدمة السوق العراقي و هدفها هو تحسين الوضع الإقتصادي العام و تشجيع القطاع الخاص و توفير فرص العمل. و كان نمو خدمات الشركة لتصل الى جميع الزبائن في المحافظات العراقية من أولوليات أصحابها منذ التأسيس، حيث عملوا جاهدين و بوقت قياسي لتحسين تجربة التسوق الألكتروني العراقية لتغطي بعد سنة واحدة جميع أنحاء العراق.

إستمر تطور الشركة، و نمت قيمتها التجارية ليصبح لديها في سنة ٢٠١٧:
فرعين رئيسيين، في بغداد و أربيل (إقليم كردستان العراق)
أكثر من ٧٠٠،٠٠٠ مستخدم عراقي
أكثر من ٢٥٠ ماركة تجارية من أكثر من ٢٠٠ تاجر محلي و عالمي

تتعامل خدمة مسواگ و القائمين عليها مع عدد من التجار المحليين و العالميين البارزين و المعتمدين في السوق - لضمان إصول المنتج للمستخدمين - ليقوموا بعرض و بيع منتجاتهم علي خدمة مسواگ.

جميع البضائع المعروضة على خدمة مسواگ هي أصلية و متوفرة لدى مخازن الشركة الرئيسية أو احد فروعها، حيث لن يتم شراء المنتج بعد طلبه من قبل الزبون. و تتكفل الشركة بنقل البضائع من مقر الشركة الى الزبائن.
''',
          style: TextStyle(
            fontSize: 18.0,
            fontWeight: FontWeight.normal,
            height: 1.6,
            fontFamily: 'Arabic',
          ),
        ),
      ),
    );
  }
}
