import 'package:flutter/material.dart';

import '../../../../core/Widget/app_bar_widget.dart';

class MiswagServices extends StatelessWidget {
  const MiswagServices({super.key});

  @override
  Widget build(BuildContext context) {
    return const Scaffold(
      appBar: AppBarWidget(pageNum: 0),
      body: SingleChildScrollView(
        padding: EdgeInsets.all(16.0),
        child: Text(
          textAlign: TextAlign.right,
          '''عن الخدمة
يتمكن المستخدم، من خلال موقع و تطبيق مسواگ، من تصفح البضائع المعروضة و طلبها للشراء لتصل له في اي محافظة عراقية بمدة لا تزيد عن سبعة ايام عمل (حسب البضائع المطلوبة و مكان التوصيل).
يقوم المستخدم بالدخول الى موقع أو تطبيق مسواگ و تسجيل حساب له بشكل مجاني بإستخدام رقم موبايل عراقي فعال، ليتمكن بعد ذلك تصفح البضائع و شرائها. تتوفر خدمة مسواگ للزبائن عن طريق الموقع الألكتروني (الموقع)، تطبيق أجهزة ال (اي او اس) أو من خلال تطبيق أجهزة ال(أندرويد).
تمكن خدمة مسواگ للتسوق الألكتروني المستخدم من تصفح البضائع المعروضة بأي وقت يناسبه و إضافة ما يود شرائه الى سلة المشتريات الألكترونية، و إكمال تصفح باقي البضائع. و عند إنتهائه من عملية ملئ السلة، يقوم المستخدم بتثبيت طلب الشراء و إضافة العنوان المراد التوصيل إليه، ليظهر له رقم الطلبية (يرجى حفظ الرقم للإشارة إليه لأي إستفسارات حول الطلب). يقوم موقع مسواگ بعدها بتجهيز الطلبية و إرسالها مع خدمة النقل لتصل الى الزبون.
تتحمل شركة مسواگ أي أضرار موجودة في البضائع لحين إستلامها من قبل الزبون.
الإستبدال الاسترجاع والضمان
يطبق مسواگ سياسة التاجر بخصوص تبديل وارجاع المنتجات، ويتم توضيح السياسة بتفاصيلها في صفحة المنتجات. وتكون آلية الاستبدال أو الإرجاع كالتالي:
عند تثبيت طلب إستبدال أو إسترجاع من قبل الزبون، يتم ارسال مندوب لإستلام المنتج المراد إستبداله أو إرجاعه من الزبون ويتم فحصه في مقر الشركة للمطابقة وتطبيق سياسة التاجر. في حال كان المنتج مطابقاً للسياسة يتم قبول الطلب وإرسال المنتج البديل أو اعادة دفع المبالغ المالية الى الزبون. في حال كان المنتج غير مطابقاً لسياسة التبديل أو الإسترجاع، يتم رفض الطلب وإعادة المنتج الى الزبون
في حالات المنتجات المشمولة بضمان، يتم تطبيق نفس الخطوات في النقطة رقم 1 وحسب شروط الضمان المذكورة
المنتجات المتضررة أو العاطلة
في حال تم توصيل منتجات متضررة أو عاطلة أو تحتوي على خلل وظيفي الى الزبون، تتم المعالجة كالتالي:
يتم تثبيت الحالة وارسال مندوب توصيل لإستلام المنتج المتضرر واعادته الى مقر الشركة لأغراض الفحص والتحقق
يتم اعادة المبالغ المترتبة الى الزبون أو الاستبدال بمنتج جديد حسب رغبة الزبون عند ثبوت حالة الضرر، يكون التوصيل مجاني ولا يترتب على الزبون أية مبالغ اضافية
في حالة ثبوت عدم وجود الضرر أو العطل في المنتج كما تم وصفه من قبل الزبون، يتم اعادة المنتج الى الزبون ويتحمل كافة التكاليف المترتبة وتشمل اجور التوصيل''',
          style: TextStyle(
            fontSize: 18.0,
            fontWeight: FontWeight.normal,
            height: 1.6,
            fontFamily: 'Arabic',
          ),
        ),
      ),
    );
  }
}
